modules/testsuite/native-tests/src/test/resources/jaxrpc/wsse/interop/sun-xws.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns0="http://xmlsoap.org/Ping" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" env:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse enc env ns0 xsd xsi"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#XWSSGID-11278852901251740661465"><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>T6JD/nEaMvquMhwh2BpvNkKj5To=</ds:DigestValue></ds:Reference><ds:Reference URI="#testthis"><ds:Transforms><ds:Transform Algorithm="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#STR-Transform"><wsse:TransformationParameters><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></wsse:TransformationParameters></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Iu2Xommc5pYQuZoybkGqCWUt2Ek=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>mStSlv1gNaWBlr5XG3Q01ScmqQOeO3L8+BbDaruT2UCVgCiwXWB+S1QyZBF3l30KPKylovFujyC+
SaZx/rt0Ag01D+UG02qlng2++q2OQO+fEptGh8AKq0wWrDDxCxams5Q2uPKvEert6qUvJlmwHrvl
qGMABBJblHsWvObNEVA=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="testthis">
<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">SJ76jrxJ2wSACTeaBwSTLEqpa7o=</wsse:KeyIdentifier>
</wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="XWSSGID-11278852901251740661465"><wsu:Created>2005-09-28T05:28:09Z</wsu:Created><wsu:Expires>2005-09-28T05:33:09Z</wsu:Expires></wsu:Timestamp></wsse:Security></env:Header><env:Body><ns0:Ping><ns0:ticket>SUNW</ns0:ticket><ns0:text>Hello !</ns0:text></ns0:Ping></env:Body></env:Envelope>
